PI2=['Уля', 'Надя', 'Соня']
PI02.append('Аля')


stack=
stack.append('Жека')


 Списки в Python — динамические структуры данных, размер которых может изменяться в процессе выполнения программы. Для создания списка используются квадратные скобки, внутри которых перечисляются элементы, разделённые запятыми. 


Массивы в Java имеют фиксированный размер, который должен быть объявлен при создании массива. Для смены размера требуется создание нового массива и копирование элементов. 


Массивы в C++ — статические, размер определяется на этапе компиляции. Для изменения размера массива требуется создать новый и скопировать элементы. 
